
LEXICON = {
    '/start': '1️⃣ Нейронка превратила человека в ирис🧍->🌼, и помочь ему можешь именно ты 🫵\n\n'
              '2️⃣ Нужно скидывать боту фото цветов и букетов, откуда угодно, как если бы вы хотели узнать, '
              'что это за цветы (даже если фактически вы знаете).\n\n'
              '3️⃣ Помоги собрать хорошую генеральную совокупность данных для валидации и дообучения нейронки, '
              'пока она не превратила нас всех в цветы🙀Поторопись, иначе будет слишком поздно🤖\n\n'
              '🎁 В 1 декаде июля тот, кто отправит самое большое кол-во релевантных изображений получит скромный, '
              'но классный приз😉\n\n'
              '✅ Пока мы только собираем ваши фото и используем их самостоятельно. В ближайшее время мы добавим '
              'функционал детекции и классификации цветов на ваших фото, и будем собирать вашу обратную связь.\n\n'
              'СКИДЫВАЙТЕ ФОТО С ЦВЕТАМИ СКОРЕЕ! Go-go-go!',

    '/help': '🌼🤖 FlowergrammerBot - помощник для цветочных энтузиастов! 🌸🌿\n\n'
             '🌟 Я здесь, чтобы помочь тебе собрать и сохранить самые красивые фотографии цветов! 📷💚\n\n'
             '🌺 Доступные команды:\n'
             '/start - начать игру и создать свою коллекцию цветов\n'
             '/size - узнать, сколько цветов ты уже накопил\n'
             '/help - получить список доступных команд\n'
             '/contacts - контакты для связи и пожеланий\n\n'
             '📷 Чтобы добавить фотографию цветка в свою коллекцию, просто отправь ее мне! Я сохраним ее. 🌼💾\n\n'
             '🗂 Каждому пользователю я создаю отдельную папку, где будут храниться все фотографии цветов. Ты '
             'можешь в любой момент посмотреть свою коллекцию и узнать, сколько красивых цветов у тебя уже есть! '
             '🌺📂✨\n\n'
             '🌸 Не забывай делиться своими находками и вдохновляться цветами других пользователей! Отправляй '
             'фотографии и наслаждайся прекрасными моментами! 🌼📸🌺\n\n'
             '🌟 Если у тебя возникли вопросы или нужна помощь, не стесняйся обращаться! Я всегда здесь, '
             'чтобы помочь тебе насладиться миром цветов! 🌸💚🤗',

    '/contacts': 'По всем вопросам и пожеланиям обращаться к @alexander_ani',

    '/size': 'Количество накопленных Вами цветов🌸',

    '/rating': 'Рейтинг участников:',

    '/url': 'Ссылка на хранилище:\n\n',

    'no username': "⚠️ Уважаемый пользователь, у вас отсутствует `username`!\n\n"
                   "📝 `Username` - это уникальное имя, которое другие пользователи "
                   "Telegram могут использовать для обращения к вам.\n\n"
                   "🚀 Чтобы создать `username`, выполните следующие шаги:\n\n"
                   "1️⃣ Откройте Telegram и перейдите в настройки аккаунта (иконка шестеренки).\n"
                   "2️⃣ Найдите раздел «Изменить профиль» и выберите его.\n"
                   "3️⃣ Найдите поле «Username» и нажмите на него.\n"
                   "4️⃣ Введите желаемое имя пользователя (username). Обратите внимание, что username должен быть "
                   "уникальным.\n"
                   "5️⃣ Если введенное имя доступно, оно будет сохранено. Если нет, вам будут предложены варианты "
                   "альтернативных"
                   "имен или вам нужно будет выбрать другое.\n\n"
                   "🔁 После создания `username` вернитесь к боту и повторно воспользуйтесь функционалом.\n\n"
                   "🌟 Спасибо за понимание и активное участие в нашем боте! 🙏😊",

    'loading': "Секундочку...🌼🌺🌸",

    'success': "Готово! Продолжайте собирать красоты чудесной природы! 🌸🌼💐",

    'error': "Извините, что-то пошло не так, обратитесь к @lead_developerr",

    'unsupported file': '❗️ Ой, похоже вы отправили неподдерживаемый тип файла. 😔\n\n'
                        'Я могу принимать только фотографии и документы-изображения. '
                        'Пожалуйста, отправьте мне фото или документ-изображение. '
                        'Если у вас возникли вопросы, вы всегда можете воспользоваться командой /help. 😉',

    'text': 'Напиши /help, и я всё Тебе расскажу! 😉'
}
